In [1]:
# Yikleme islemi (install)
'''
%%!
pip install --trusted-host pypi.org ipython-sql
'''

'\n%%!\npip install --trusted-host pypi.org ipython-sql\n'

### Resmi Internet Sitesi
https://www.sqlite.org/lang_mathfunc.html

In [2]:
%load_ext sql

In [3]:
# Baglanti islemi (Connect)

%sql sqlite:///vbo.db

In [4]:
%%sql
SELECT * FROM Orders LIMIT 3;

 * sqlite:///vbo.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2)]

# Manuel Tablo Olusturmak

In [5]:
%%sql
CREATE TABLE yeni_tablo(firstname varcahr(20),
                       lastname varcahr(20))

 * sqlite:///vbo.db
(sqlite3.OperationalError) table yeni_tablo already exists
[SQL: CREATE TABLE yeni_tablo(firstname varcahr(20),
                       lastname varcahr(20))]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## Tabloya Deger Eklemek

In [6]:
%%sql
INSERT INTO yeni_tablo VALUES('Ali', 'Uzaya_Git')

 * sqlite:///vbo.db
1 rows affected.

[]

In [7]:
%sql SELECT * FROM yeni_tablo;

 * sqlite:///vbo.db
Done.

[('Mehmet', 'Cevik'),
 ('Ali', 'Uzaya_Git'),
 ('Abdullah', 'SQL_Ogren'),
 ('Ali', 'Uzaya_Git'),
 ('Ali', 'Uzaya_Git'),
 ('Ali', 'Uzaya_Git')]

# SELECT islemleri

In [8]:
%%sql
SELECT * FROM Products Limit 3;

 * sqlite:///vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)]

In [9]:
# Veri Tabanindaki tum tablolari secme

%sql SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///vbo.db
Done.

[('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Products',),
 ('Shippers',),
 ('Suppliers',),
 ('yeni_tablo',)]

In [10]:
# Bir Tabloda degisken isimlerine ulasmak

%sql SELECT * FROM Customers WHERE 1=0;

 * sqlite:///vbo.db
Done.

[]

In [11]:
# Bir Tabloda istedigin kolonlari secmek

%sql SELECT CustomerName, City FROM Customers LIMIT 3;

 * sqlite:///vbo.db
Done.

[('Alfreds Futterkiste', 'Berlin'),
 ('Ana Trujillo Emparedados y helados', 'México D.F.'),
 ('Antonio Moreno Taquería', 'México D.F.')]

In [12]:
%sql SELECT * FROM Products LIMIT 3;

 * sqlite:///vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10)]

In [17]:
%sql SELECT Price, (Price*2) FROM Products LIMIT 3;

 * sqlite:///vbo.db
Done.

[(18, 36), (19, 38), (10, 20)]

In [27]:
%sql SELECT Price, (Price*Price), power(Price,2) FROM Products LIMIT 3;

 * sqlite:///vbo.db
Done.

[(18, 324, 324.0), (19, 361, 361.0), (10, 100, 100.0)]

### Kolon ADI degistirme (alias : AS)

In [32]:
%sql SELECT Price, (Price*2) AS Price2Kati, power(Price,2) AS PriceKaresi  FROM Products LIMIT 3;

 * sqlite:///vbo.db
Done.

[(18, 36, 324.0), (19, 38, 361.0), (10, 20, 100.0)]

## Count

In [33]:
%sql SELECT COUNT(*) FROM Customers

 * sqlite:///vbo.db
Done.

[(91,)]

In [34]:
%sql SELECT COUNT(*) AS SatirSayisi FROM Customers

 * sqlite:///vbo.db
Done.

[(91,)]

## Order By

In [35]:
%sql SELECT * FROM Products LIMIT 5;

 * sqlite:///vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

In [36]:
%sql SELECT * FROM Products ORDER BY Price LIMIT 5;

 * sqlite:///vbo.db
Done.

[(13, 'Konbu', 6, 8, '2 kg box', 6),
 (52, 'Filo Mix', 24, 5, '16 - 2 kg boxes', 7),
 (23, 'Tunnbröd', 9, 5, '12 - 250 g pkgs.', 9),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (21, "Sir Rodney's Scones", 8, 3, '24 pkgs. x 4 pieces', 10)]

In [39]:
# Butukten Kucuge Siralama (DESC)

%sql SELECT * FROM Products ORDER BY Price DESC Limit 5;

 * sqlite:///vbo.db
Done.

[(31, 'Gorgonzola Telino', 14, 4, '12 - 100 g pkgs', 435),
 (38, 'Côte de Blaye', 18, 1, '12 - 75 cl bottles', 263),
 (29, 'Thüringer Rostbratwurst', 12, 6, '50 bags x 30 sausgs.', 123),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (20, "Sir Rodney's Marmalade", 8, 3, '30 gift boxes', 81)]

In [41]:
%sql SELECT * FROM Products ORDER BY ProductID Limit 5;

 * sqlite:///vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

# <font color=red>Where ifadesi</font>

In [42]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [45]:
# Ulkesi almanya olanlari sec
%sql SELECT * FROM Customers WHERE Country = 'Germany';

 * sqlite:///vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany'),
 (17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany'),
 (25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany'),
 (39, 'Königlich Essen', 'Philip Cramer', 'Maubelstr. 90', 'Brandenburg', '14776', 'Germany'),
 (44, 'Lehmanns Marktstand', 'Renate Messner', 'Magazinweg 7', 'Frankfurt a.M.', '60528', 'Germany'),
 (52, 'Morgenstern Gesundkost', 'Alexander Feuer', 'Heerstr. 22', 'Leipzig', '4179', 'Germany'),
 (56, 'Ottilies Käseladen', 'Henriette Pfalzheim', 'Mehrheimerstr. 369', 'Köln', '50739', 'Germany'),
 (63, 'QUICK-Stop', 'Horst Kloss', 'Taucherstraße 10', 'Cunewalde', '1307', 'Germany'),
 (79, 'Toms Spezialitäten', 'Karin Josephs', 'Luisenstr. 48', 'Münster', '44087', 'Germany'),
 (86, 'Die Wandernde Kuh', 'Rita Müller', 'Adenauerallee 900', 'Stuttgart', '70563', 'Germany')]

In [46]:
%sql SELECT * FROM Customers WHERE City = 'Berlin';

 * sqlite:///vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')]

### WHERE NOT

In [49]:
%%sql
SELECT * FROM Customers WHERE NOT City = 'Berlin' LIMIT 5;

 * sqlite:///vbo.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')]

### Where Numeric Secim

In [52]:
%%sql
SELECT * FROM Customers WHERE CustomerID = 6 ;

 * sqlite:///vbo.db
Done.

[(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')]

In [53]:
%%sql
SELECT * FROM Customers WHERE CustomerID < 6 ;

 * sqlite:///vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

# <font color=red>And ve Or ifadeler</font>

In [ ]:
#